app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create!(params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Pronosticos"], ["room_number", 155], ["created_at", "2020-08-27 03:27:58.182468"], ["updated_at", "2020-08-27 03:27:58.182468"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        student.update(school_classes_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Thermo"], ["room_number", 999], ["updated_at", "2020-08-27 03:38:45.161781"], ["id", 1]]