app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE (#<Student::ActiveRecord_Relation:0x00007fe3f95ead00>) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Amazon"], ["updated_at", "2020-08-27 17:02:48.954780"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def edit
        @student = Student.find(params[:id])